Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_minimum_wage.html.txt.tmx
Source language: en
Languages: ga

source: Sean works 43 hours per week including three hours on a Saturday
ga: Oibríonn Seán 43 uaireanta in aghaidh na seachtaine ina áirítear trí uair a' chloig ar an Satharn

source: He is entitled to the minimum wage of €9.25 as he is an experienced adult employee and isn't on a training or study course
ga: Tá sé i dteideal íosphá de €9.25 toisc gur fostaí aosach taithíthe é agus níl sé ar chúrsa oiliúna ná staidéir

source: He is paid a gross wage of €400 per week
ga: Íoctar ollphá de €400 in aghaidh na seachtaine leis

source: Sean's pay includes a €20 premium for working Saturdays
ga: Cuimsítear táille €20 sa phá do Sheán as ucht oibriú Dé Sathairn

source: He asked his employer about the national minimum wage and his employer gave him the following information:
ga: D'iarr sé ar a fhostóir faoin íosphá náisiúnta agus thug a fhostóir an teolas a leanas dó:

source: • The pay reference period is weekly
ga: • Tá an tréimhse tagartha pá ar bhonn seachtainiúil

source: • Dividing the gross pay (€400) by the hours worked (43), this gives an average hourly pay of €9.30
ga: • Má roinntear an t-ollphá (€400) ar na huaireanta a oibríodh (43), tugann sé seo meánráta pá de €9.30 in aghaidh na huaire

source: This is slightly above the current national minimum wage of €9.25 per hour
ga: Tá sé seo beagán os cionn an íosráta pá náisiúnta de €9.25 in aghaidh na huaire

source: Is Sean's employer correct?
ga: An bhfuil fostóir Seán ceart?

source: No, Sean's employer is incorrect
ga: Níl, tá fostóir Seán mícheart

source: The €20 premium for working on Saturdays should not be included for national minimum wage purposes
ga: Níor chóir go gcuimseofaí an táille €20 as ucht oibriú Dé Sathairn do chuspóirí an íosphá náisiúnta

source: This means that only €380 should be divided by 43, giving an average hourly pay of €8.84 - below the national minimum wage of €9.25
ga: Ciallaíonn sé seo gur cheart €380 amháin a roinnt ar 43, ag tabhairt meánráta pá de €8.84 - taobh thíos den íosphá náisiúnta ag €9.25

source: Sean's entitlement is a basic wage of €397.75 (€9.25 x 43) plus €20 Saturday premium which comes to a total of €417.75
ga: Is bunphá de €397.75 (€9.25 x 43) móide €20 mar tháille an Sathairn atá mar theidlíocht ag Seán a thagann go dtí iomlán de €417.75
